# ModelCurveArrayIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurveArrayIterator Class
Members See Also
---
An iterator to a model curve array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class ModelCurveArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class ModelCurveArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class ModelCurveArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ModelCurveArrayIterator
# See Also
ModelCurveArrayIterator Members
Autodesk.Revit.DB Namespace